"MESSAGE_TEXT" = "%1$@: %2$@";
"MESSAGE_NOTEXT" = "%1$@ sent you a message";
"MESSAGE_PHOTO" = "%1$@ sent you a photo";
"MESSAGE_VIDEO" = "%1$@ sent you a video";
"MESSAGE_CONTACT" = "%1$@ shared a contact with you";
"MESSAGE_GEO" = "%1$@ sent you a map";
"MESSAGE_DOC" = "%1$@ sent you a file";
"MESSAGE_AUDIO" = "%1$@ sent you a voice note";
"ENCRYPTED_MESSAGE" = "You have a new message%1$@";
"LOCKED_MESSAGE" = "You have a new message%1$@";
"ENCRYPTION_REQUEST" = "New encryption request%1$@";
"ENCRYPTION_ACCEPT" = "Your encryption request was accepted%1$@";
"DC_UPDATE" = "Open this notification to update app settings";

"CHAT_JOINED" = "%1$@ has joined the group %2$@";

"CHAT_MESSAGE_TEXT" = "%1$@@%2$@: %3$@";
"CHAT_MESSAGE_NOTEXT" = "%1$@ sent a message to the group %2$@";
"CHAT_MESSAGE_PHOTO" = "%1$@ sent a photo to the group %2$@";
"CHAT_MESSAGE_VIDEO" = "%1$@ sent a video to the group %2$@";
"CHAT_MESSAGE_CONTACT" = "%1$@ shared a contact in the group %2$@";
"CHAT_MESSAGE_GEO" = "%1$@ sent a map to the group %2$@";
"CHAT_MESSAGE_DOC" = "%1$@ sent a file to the group %2$@";
"CHAT_MESSAGE_AUDIO" = "%1$@ sent a voice note to the group %2$@";
"CHAT_CREATED" = "%1$@ invited you to the group %2$@";
"CHAT_TITLE_EDITED" = "%1$@ edited the group's %2$@ name";
"CHAT_PHOTO_EDITED" = "%1$@ edited the group's %2$@ photo";
"CHAT_ADD_MEMBER" = "%1$@ invited %3$@ to the group %2$@";
"CHAT_ADD_YOU" = "%1$@ invited you to the group %2$@";
"CHAT_DELETE_YOU" = "%1$@ removed you from the group %2$@";
"CHAT_DELETE_MEMBER" = "%1$@ removed %3$@ from the group %2$@";
"CHAT_LEFT" = "%1$@ left the group %2$@";
"CHAT_RETURNED" = "%1$@ returned to the group %2$@";

"MESSAGE_STICKER" = "%1$@ sent you a sticker";
"CHAT_MESSAGE_STICKER" = "%1$@ sent a sticker to the group %2$@";

"CONTACT_JOINED" = "%1$@ joined Telegram!";
"CONTACT_ACTIVATED" = "%1$@ helped you activate your account!";

"AUTH_UNKNOWN" = "Login from a new device %1$@";
"AUTH_REGION" = "Login from a new device %1$@, location: %2$@";

"MESSAGE_FWDS" = "%1$@ forwarded you %2$@ messages";
"CHAT_MESSAGE_FWDS" = "%1$@ forwarded %3$@ messages to the group %2$@";

"CHANNEL_MESSAGE_TEXT" = "%1$@: %2$@";
"CHANNEL_MESSAGE_NOTEXT" = "%1$@ posted a message";
"CHANNEL_MESSAGE_PHOTO" = "%1$@ posted a photo";
"CHANNEL_MESSAGE_VIDEO" = "%1$@ posted a video";
"CHANNEL_MESSAGE_DOC" = "%1$@ posted a document";
"CHANNEL_MESSAGE_STICKER" = "%1$@ posted a sticker";
"CHANNEL_MESSAGE_AUDIO" = "%1$@ posted a voice message";
"CHANNEL_MESSAGE_CONTACT" = "%1$@ posted a contact";
"CHANNEL_MESSAGE_GEO" = "%1$@ posted a map";
"CHANNEL_MESSAGE_FWDS" = "%1$@ posted %2$@ forwarded messages";

"App.Name" = "Telegram";

"Presence.online" = "online";
"Presence.offline" = "offline";
"Presence.invisible" = "invisible";

"Month.GenJanuary" = "January";
"Month.GenFebruary" = "February";
"Month.GenMarch" = "March";
"Month.GenApril" = "April";
"Month.GenMay" = "May";
"Month.GenJune" = "June";
"Month.GenJuly" = "July";
"Month.GenAugust" = "August";
"Month.GenSeptember" = "September";
"Month.GenOctober" = "October";
"Month.GenNovember" = "November";
"Month.GenDecember" = "December";
"Month.ShortJanuary" = "Jan";
"Month.ShortFebruary" = "Feb";
"Month.ShortMarch" = "Mar";
"Month.ShortApril" = "Apr";
"Month.ShortMay" = "May";
"Month.ShortJune" = "Jun";
"Month.ShortJuly" = "Jul";
"Month.ShortAugust" = "Aug";
"Month.ShortSeptember" = "Sep";
"Month.ShortOctober" = "Oct";
"Month.ShortNovember" = "Nov";
"Month.ShortDecember" = "Dec";
"Weekday.ShortMonday" = "Mon";
"Weekday.ShortTuesday" = "Tue";
"Weekday.ShortWednesday" = "Wed";
"Weekday.ShortThursday" = "Thu";
"Weekday.ShortFriday" = "Fri";
"Weekday.ShortSaturday" = "Sat";
"Weekday.ShortSunday" = "Sun";
"Weekday.Monday" = "Monday";
"Weekday.Tuesday" = "Tuesday";
"Weekday.Wednesday" = "Wednesday";
"Weekday.Thursday" = "Thursday";
"Weekday.Friday" = "Friday";
"Weekday.Saturday" = "Saturday";
"Weekday.Sunday" = "Sunday";

"Time.TodayAt" = "today at %@";
"Time.YesterdayAt" = "yesterday at %@";

"LastSeen.JustNow" = "just now";
"LastSeen.MinutesAgo_1" = "1 minute ago";
"LastSeen.MinutesAgo_2" = "2 minutes ago";
"LastSeen.MinutesAgo_3_10" = "%@ minutes ago";
"LastSeen.MinutesAgo_any" = "%@ minutes ago";
"LastSeen.HoursAgo_1" = "1 hour ago";
"LastSeen.HoursAgo_2" = "2 hours ago";
"LastSeen.HoursAgo_3_10" = "%@ hours ago";
"LastSeen.HoursAgo_any" = "%@ hours ago";
"LastSeen.TodayAt" = "today at %@";
"LastSeen.YesterdayAt" = "yesterday at %@";
"LastSeen.AtWeekday" = "%@";
"LastSeen.AtDate" = "%@";
"LastSeen.Lately" = "recently";
"LastSeen.WithinAWeek" = "within a week";
"LastSeen.WithinAMonth" = "within a month";
"LastSeen.ALongTimeAgo" = "a long time ago";

"FileSize.B" = "%@ B";
"FileSize.KB" = "%@ KB";
"FileSize.MB" = "%@ MB";

"Notification.RenamedChat" = "%@ renamed the group";
"Notification.ChangedGroupPhoto" = "%@ changed group photo";
"Notification.RemovedGroupPhoto" = "%@ removed group photo";
"Notification.ChangedUserPhoto" = "%@ added a new profile photo";
"Notification.RemovedUserPhoto" = "%@ removed profile photo";
"Notification.JoinedChat" = "%@ joined the group";
"Notification.Invited" = "%@ invited %@";
"Notification.LeftChat" = "%@ left the group";
"Notification.Kicked" = "%@ removed %@";
"Notification.CreatedChat" = "%@ created a group";
"Notification.CreatedChatWithTitle" = "%@ created the group \"%@\"";
"Notification.Joined" = "Joined Telegram";
"Notification.ChangedGroupName" = "%@ changed group name to \"%@\"";
"Notification.JoinedGroupByLink" = "%@ joined the group via invite link";

"Compose.AddContact" = "Choose Contact";
"Compose.CreateMessage" = "Create Message";
"Compose.CurrentLocation" = "Current Location";
"Compose.Send" = "Send";

"Contacts.NoResults" = "No matching\ncontacts found";

"ChatList.NoConversationsTitle" = "No Conversations";
"ChatList.NoConversationsText" = "To start messaging,\npress firmly, then tap\nNew Message";
"ChatList.Compose" = "New Message";
"ChatList.You" = "You";

"Conversation.Reply" = "Reply";
"Conversation.Unblock" = "Unblock";
"Conversation.UserInfo" = "Info";
"Conversation.GroupInfo" = "Group Info";

"Message.Photo" = "Photo";
"Message.Video" = "Video";
"Message.Location" = "Location";
"Message.Contact" = "Contact";
"Message.File" = "File";
"Message.Sticker" = "Sticker";
"Message.Audio" = "Audio";
"Message.ForwardedMessage" = "Forwarded from";
"Message.ForwardedFrom" = "%@";

"UserInfo.Title" = "Info";
"UserInfo.Service" = "service notifications";
"UserInfo.GenericPhoneLabel" = "mobile";
"UserInfo.UsernameLabel" = "username";
"UserInfo.Block" = "Block";
"UserInfo.Unblock" = "Unblock";
"UserInfo.Mute_1" = "Mute for 1 hour";
"UserInfo.Mute_2" = "Mute for 2 hours";
"UserInfo.Mute_3_10" = "Mute for %@ hours";
"UserInfo.Mute_any" = "Mute for %@ hours";
"UserInfo.Mute" = "Mute";
"UserInfo.Unmute" = "Unmute";
"UserInfo.SendMessage" = "Send Message";

"Bot.GenericBotStatus" = "bot";
"Bot.About" = "about";

"GroupInfo.Title" = "Group Info";
"GroupInfo.ParticipantCount_1" = "1 member";
"GroupInfo.ParticipantCount_2" = "2 members";
"GroupInfo.ParticipantCount_3_10" = "%@ members";
"GroupInfo.ParticipantCount_any" = "%@ members";
"GroupInfo.StatusOnline_1" = "1 online";
"GroupInfo.StatusOnline_2" = "2 online";
"GroupInfo.StatusOnline_3_10" = "%@ online";
"GroupInfo.StatusOnline_any" = "%@ online";

"MessageView.Title" = "Message";
"MessageView.Forward" = "Forward";
"MessageView.Reply" = "Reply";
"MessageView.ViewOnPhone" = "View On Phone";

"PhotoView.Title" = "Photo";

"Stickers.Recents" = "Recents";
"Stickers.RecentPlaceholder" = "Your most frequently used stickers will appear here";
"Stickers.StickerPacks" = "Sticker Packs";
"Stickers.BuiltinPackName" = "Great Minds";
"Stickers.StickerCount_1" = "1 sticker";
"Stickers.StickerCount_2" = "2 stickers";
"Stickers.StickerCount_3_10" = "%@ stickers";
"Stickers.StickerCount_any" = "%@ stickers";

"Location.Current" = "Current Location";
"Location.Access" = "Allow Telegram to access location on your phone";

"Auth.LoginRequired" = "Log in to Telegram on your phone to get started";
"Passcode.UnlockRequired" = "Unlock Telegram on your phone";

"State.Connecting" = "Connecting...";
"State.Updating" = "Updating...";
"State.WaitingForNetwork" = "No Network";

"Suggestion.OK" = "OK";
"Suggestion.ThankYou" = "Thank you.";
"Suggestion.Thanks" = "Thanks!";
"Suggestion.WhatsUp" = "What's up?";
"Suggestion.Yes" = "Yes";
"Suggestion.No" = "No";
"Suggestion.Absolutely" = "Absolutely";
"Suggestion.Nope" = "Nope";
"Suggestion.TalkLater" = "Talk later?";
"Suggestion.CantTalk" = "Can't talk now...";
"Suggestion.HoldOn" = "Hold on a sec...";
"Suggestion.CallSoon" = "Call you soon.";
"Suggestion.TextInABit" = "Text you in a bit.";
"Suggestion.BRB" = "BRB";
"Suggestion.OnMyWay" = "I'm on my way.";

"Bot.Commands" = "Commands";
"Bot.Start" = "Start";
"Bot.Restart" = "Restart";
"Bot.IntroTitle" = "What can this bot do?";

"ChannelInfo.Title" = "Info";
"Channel.GenericChannelStatus" = "channel";
"Channel.Link" = "link";
"Channel.About" = "about";

"Notification.ChannelCreated" = "Channel created";
"Notification.ChannelPhotoUpdated" = "Channel photo updated";
"Notification.ChannelPhotoRemoved" = "Channel photo removed";
"Notification.ChannelTitleUpdated" = "Channel renamed";
"Notification.ChannelFullTitleUpdated" = "Channel renamed to \"%@\"";
"Notification.ChannelInviter" = "%@ invited you to this channel";

"App.NoConnection" = "No Connection";
"App.ConnectionDescription" = "Your Watch needs to be connected for the app to work";

"Presets.Title" = "Reply Presets";
"Preset.n" = "Preset %d";

"Time.ShortTodayAt" = "Today %@";
"Time.ShortYesterdayAt" = "Yesterday %@";
"Time.ShortWeekdayAt" = "%1$@ %2$@";
"Time.ShortFullAt" = "%1$@ %2$@";

"Notification.GroupMigratedToChannel" = "The group was upgraded to a supergroup";
"Notification.GroupDeactivated" = "Group deactivated";
"Notification.GroupActivated" = "Group activated";
"Notification.ChannelMigratedFrom" = "This group was upgraded to a supergroup";
